# Data Transformation and Mapping 
- **apply**: allous us to apply a function to each element, row or column in a DataFrame or Series
- **map**: is used to map values in a Series according to a dictionary or another Series
- **replace**: replace allows for replacin specific values in the DataFrame with new value
- **astype**: this is used to convert data type
- **pipe**: it allows chaining and using complex functions that operateon the entire DataFrame. This can be used for complex transformation operation

## Apply

In [2]:
#convert marks to scale of 1
import pandas as pd
students = pd.read_csv('../Week_3_Mathmatics/data/student.csv')
students['mark_percent'] = students['mark'].apply(lambda m: m/100)
students.head()

   id        name  class  mark  gender  mark_percent
0   1    John Deo   Four    75  female          0.75
1   2    Max Ruin  Three    85    male          0.85
2   3      Arnold  Three    55    male          0.55
3   4  Krish Star   Four    60  female          0.60
4   5   John Mike   Four    60  female          0.60

## MAP

In [3]:
# replace
students['grade']= students['class'].map({'One':1,'Two':2, 'Three':3, 'Four':4, 'Five':5, 'Six':6, 'Severn':7, 'Eight':8, 'Nine':9, 'Ten': 10})
students['gender_code'] = students['gender'].map({'male':1 , 'female':2})
students.head()

   id        name  class  mark  gender  mark_percent  grade  gender_code
0   1    John Deo   Four    75  female          0.75    4.0            2
1   2    Max Ruin  Three    85    male          0.85    3.0            1
2   3      Arnold  Three    55    male          0.55    3.0            1
3   4  Krish Star   Four    60  female          0.60    4.0            2
4   5   John Mike   Four    60  female          0.60    4.0            2

## Replace

In [4]:
#replace soecific values in the 'class' column 
students['class'] = students['class'].replace({'Four': '4th', 'Ten': '10th', 'Eight':'8th'})
#replace name 'John Doe' with 'JaiRam' (replace specific value)
students['name'] = students['name'].replace({'John Deo':'Jai Ram'})
students.head()

   id        name  class  mark  gender  mark_percent  grade  gender_code
0   1     Jai Ram    4th    75  female          0.75    4.0            2
1   2    Max Ruin  Three    85    male          0.85    3.0            1
2   3      Arnold  Three    55    male          0.55    3.0            1
3   4  Krish Star    4th    60  female          0.60    4.0            2
4   5   John Mike    4th    60  female          0.60    4.0            2

## astype

In [24]:
# Convert 'marks' column to float
students['mark'] = students['mark'].astype(float)
students.head()

,id,name,class,mark,gender,mark_percent,grade,gender_code,result
0,1,Jai Ram,4th,358722675.0,female,0.75,4.0,2,True
1,2,Max Ruin,Three,406552365.0,male,0.85,3.0,1,True
2,3,Arnold,Three,263063295.0,male,0.55,3.0,1,True
3,4,Krish Star,4th,286978140.0,female,0.60,4.0,2,True
4,5,John Mike,4th,286978140.0,female,0.60,4.0,2,True

## pipe

In [21]:
# create a function that triples marks and pipes it to the pandas DataFrame
def triple_marks(df):
    df['mark'] = df['mark'] * 3
    return df

def check_result(df):
    df['result'] = df['mark']>40
    return df

students = students.pipe(check_result)
students.head()

,id,name,class,mark,gender,mark_percent,grade,gender_code,result
0,1,Jai Ram,4th,358722675.0,female,0.75,4.0,2,True
1,2,Max Ruin,Three,406552365.0,male,0.85,3.0,1,True
2,3,Arnold,Three,263063295.0,male,0.55,3.0,1,True
3,4,Krish Star,4th,286978140.0,female,0.60,4.0,2,True
4,5,John Mike,4th,286978140.0,female,0.60,4.0,2,True